function Keshi(){
	this.Items = {};
}
Keshi.prototype.add = function(id,iArray){
	this.Items[id] = iArray;
}
Keshi.prototype.Exists = function(id){
	if(typeof(this.Items[id]) == "undefined") return false;
	return true;
}

function changekeshi(v){
	var str="0";
	for(i=0;i<v;i++){
		str+=("_"+(document.getElementById(ks[i]).selectedIndex-1));
	};
	var ss=document.getElementById(ks[v]);
	with(ss){
		length = 0;
		options[0]=new Option(option0[v],option0[v]);
		if(v && document.getElementById(ks[v-1]).selectedIndex>0 || !v){
			if(keshi.Exists(str)){
				ar = keshi.Items[str];
				for(i=0;i<ar.length;i++){
					options[length]=new Option(ar[i],ar[i]);
				}//end for
				if(v){ options[0].selected = true; }
			}
		}//end if v
		if(++v<ks.length){changekeshi(v);}
	}//End with
}

var keshi = new Keshi();
keshi.add("0",["内科","外科","妇产科","儿科","神经科","精神心理科","中医科","肿瘤科","眼科","口腔科","耳鼻咽喉科","急诊科","麻醉科","皮肤性病科","护理科","临床其他","检验科","病理科","影像科","功能检查科","药剂科","行政辅助","科研中心","其他"]);
keshi.add("0_0",["心血管内科","消化内科","内分泌科","免疫科","风湿科","呼吸科","肾脏内科","血液科","传染科","感染科","肝病科","结核病科","艾滋病科","过敏反应科","老年病科","普通内科","全科","特色医疗科","干部诊疗科"]); 
keshi.add("0_1",["普外科","肝胆外科","胃肠外科","肛肠外科","胰腺外科","乳腺外科","甲状腺外科","血管外科","神经外科","脑外科","心胸外科","心脏外科","胸外科","骨科","创伤骨科","脊柱外科","关节骨科","手外科","骨肿瘤科","运动医学科","骨代谢科","泌尿外科","整形科","烧伤科","器官移植","微创外科","腔镜外科","手术室","外伤科"]); 
keshi.add("0_2",["妇科","妇科内分泌","妇泌尿科","妇科肿瘤","产科","产房","普通产科","高危产科","产前检查科","遗传科","计划生育科","生殖中心"]); 
keshi.add("0_3",["小儿内科","小儿呼吸科","小儿消化科","小儿神经内科","小儿心内科","小儿肾内科","小儿内分泌科","小儿免疫科","小儿血液科","小儿感染科","小儿精神科","小儿外科","小儿心外科","小儿胸外科","小儿骨科","小儿泌尿科","小儿神经外科","小儿整形科","新生儿科","小儿皮肤科","小儿耳鼻喉","小儿妇科","小儿急诊科","儿童保健科","儿童康复科"]); 
keshi.add("0_4",["神经科"]); 
keshi.add("0_5",["精神科","心理科","司法鉴定科"]); 
keshi.add("0_6",["中医内科","中医内分泌","中医消化科","中医呼吸科","中医肾脏内科","中医免疫内科","中医心内科","中医神经内科","中医精神科","中医肿瘤科","中医血液科","中医感染内科","中医肝病科","中医男科","中医老年病科","中医外科","中医骨伤科","中医乳腺外科","中医肛肠科","中医妇产科","中医儿科","中医皮肤科","中医五官科","中医按摩科","针灸科","推拿科","中西医结合科"]); 
keshi.add("0_7",["肿瘤内科","肿瘤外科","肿瘤妇科","放疗科","骨肿瘤科","肿瘤康复科","肿瘤综合科"]); 
keshi.add("0_8",["眼底","角膜科","青光眼","白内障","眼外伤","眼眶及肿瘤","眼视光学","眼整形","中医眼科","小儿眼科"]); 
keshi.add("0_9",["正畸科","颌面外科","牙体牙髓科","牙周科","口腔粘膜科","儿童口腔科","口腔修复科","种植科","口腔预防科","口腔特诊科","口腔急诊科"]);
keshi.add("0_10",["耳鼻咽喉科","头颈外科"]);
keshi.add("0_11",["急诊科","重症监护室"]);
keshi.add("0_12",["麻醉科","疼痛科"]);
keshi.add("0_13",["皮肤科","性病科","皮肤美容","激光室","男科"]);
keshi.add("0_14",["基础护理","内科护理","外科护理","妇产科护理","儿科护理","ICU护理","手术室护理","五官科护理","肿瘤护理"]);
keshi.add("0_15",["门诊部","介入医学科","康复科","理疗科","预防保健科","高压氧科","体检科","职业病科","地方病科","营养科","特诊科","输血科"]);
keshi.add("0_16",["血液检验","体液检验","生化室","免疫室","临床检验室","临床微生物室","PCR实验室","消毒供应室","血气室","细胞室","微量元素室","急诊化验室"]);
keshi.add("0_17",["病理科"]);
keshi.add("0_18",["核医学科","放射科","X线室","CT室","spect室","MRI室","超声科","B超科","彩超科","心超科"]);
keshi.add("0_19",["心电图室","脑电图室","肌电图室","肺功能室","骨密度室","内镜科","血透中心","碎石中心"]);
keshi.add("0_20",["中药房","西药房","调剂科","制剂室","质检科","药剂实验室","药理实验室"]);
keshi.add("0_21",["科教处","医务科","病案科","院感科","信息科","院办宣传科","研究生处","党办人事科","医保科护理部","质控科","后勤科"]);
keshi.add("0_22",["实验中心","分子生物学实验室","细胞培养实验室","免疫组化实验室","质谱分析室","动物房血液研究所","肿瘤研究所","临床医学研究所","老年病研究所","神经研究所","心血管病研究所","精神卫生研究所","职业病研究所","中医药研究院"]);
keshi.add("0_23",["其他"]);
var ks=["s1","s2"]; 
var option0 = ["请选择科室类别","请选择科室"]; 
function setup(){  //初始化函数
	for(i=0;i<ks.length-1;i++){
	  document.getElementById(ks[i]).onchange=new Function("changekeshi("+(i+1)+")");
	}
	changekeshi(0);
}
setup();